#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
data.google_client_config.default: Reading...
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_service_account.airflow_user_sa: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/airflow-user-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["rawg-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-rawg-api-extracts]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["rawg-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-rawg-api-extracts/roles/storage.objectAdmin]
google_project_iam_binding.gcs_access: Refreshing state... [id=exemplary-tide-379122/roles/storage.objectAdmin]
google_project_iam_binding.gsm_access: Refreshing state... [id=exemplary-tide-379122/roles/secretmanager.secretAccessor]
google_project_iam_binding.bq_access: Refreshing state... [id=exemplary-tide-379122/roles/bigquery.dataEditor]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.rawg_api_dataset will be created
  + resource "google_bigquery_dataset" "rawg_api_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "rawg_api_elt_dataset"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = true
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + labels                     = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "us-east1"
      + max_time_travel_hours      = (known after apply)
      + project                    = (sensitive value)
      + self_link                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*